app/views/dashboard/_node_meta.html.erb

SELECT COUNT(*) FROM "comments"  WHERE "comments"."nid" = 7
---
<<<<<<< HEAD
    <a href="<%= node.path %>#comments"><i class="fa fa-comment-o"></i> <%= node.comments_viewable_by(current_user).length %></a>