app/views/users/list.html.erb

                      <li><a href='/notes/author/<%= user.name %>'><%= user.note_count %> Research Notes</a></li>
                      <li><a style="color: #808080; cursor: no-drop;"><%= user.nodes.count %> Wiki Edits</a></li>
---
SELECT  "node".* FROM "node"  WHERE "node"."uid" = 1  ORDER BY changed DESC LIMIT 1