app/controllers/home_controller.rb

SELECT COUNT(*) FROM "node"  WHERE "node"."type" = 'note' AND "node"."status" = 1 AND ("node"."created" BETWEEN 1518233315 AND 1518838115)
SELECT COUNT("node_revisions"."timestamp") FROM "node_revisions"  WHERE ("node_revisions"."timestamp" BETWEEN 1518233315 AND 1518838115)
SELECT  "node".* FROM "node"  WHERE "node"."type" = 'note' AND (node.nid NOT IN (0)) AND (nid != (8)) AND ((node.status = 1 OR node.status = 4))  ORDER BY nid DESC LIMIT 30 OFFSET 0
SELECT node.*, term_data.*, community_tags.* FROM "node" INNER JOIN "community_tags" ON "community_tags"."nid" = "node"."nid" LEFT OUTER JOIN term_data ON term_data.tid = community_tags.tid WHERE "node"."type" = 'note' AND "node"."status" = 1 AND (term_data.name = ('hidden:response'))
SELECT  node.nid, node.created, node.status, term_data.*, community_tags.* FROM "term_data" INNER JOIN "community_tags" ON "community_tags"."tid" = "term_data"."tid" INNER JOIN "community_tags" "node_tags_term_data_join" ON "node_tags_term_data_join"."tid" = "term_data"."tid" INNER JOIN "node" ON "node"."nid" = "node_tags_term_data_join"."nid" WHERE (node.status = 1) AND (node.created > 1516159715) AND (node.created <= 1518838115) GROUP BY "term_data"."name"  ORDER BY count DESC LIMIT 5
SELECT "term_data".* FROM "term_data"  WHERE (term_data.name IN ('blog'))
---
  def dashboard
    @note_count = Node.select([:created, :type, :status])
                      .where(type: 'note', status: 1, created: Time.now.to_i - 1.weeks.to_i..Time.now.to_i)
                      .count
    @wiki_count = DrupalNodeRevision.select(:timestamp)
                                    .where(timestamp: Time.now.to_i - 1.weeks.to_i..Time.now.to_i)
                                    .count
    @blog = Tag.find_nodes_by_type('blog', 'note', 1).first
    # remove "classroom" postings; also switch to an EXCEPT operator in sql, see https://github.com/publiclab/plots2/issues/375
    hidden_nids = Node.joins(:drupal_node_community_tag)
                      .joins('LEFT OUTER JOIN term_data ON term_data.tid = community_tags.tid')
                      .select('node.*, term_data.*, community_tags.*')
                      .where(type: 'note', status: 1)
                      .where('term_data.name = (?)', 'hidden:response')
                      .collect(&:nid)
    @notes = Node.where(type: 'note')
                 .where('node.nid NOT IN (?)', hidden_nids + [0]) # in case hidden_nids is empty
                 .order('nid DESC')
                 .page(params[:page])
    @notes = @notes.where('nid != (?)', @blog.nid) if @blog

SELECT  "node_revisions".* FROM "node_revisions" INNER JOIN "node" ON "node"."nid" = "node_revisions"."nid" WHERE (type = ('page')) AND (node.status = 1) AND (node_revisions.status = 1) AND (timestamp - node.created > 300) GROUP BY node.title  ORDER BY timestamp DESC LIMIT 10
---
    @wikis = Node.where(type: 'page', status: 1)
                 .order('nid DESC')
                 .limit(10)
    revisions = DrupalNodeRevision.joins(:node)
                                  .order('timestamp DESC')
                                  .where('type = (?)', 'page')
                                  .where('node.status = 1')
                                  .where('node_revisions.status = 1')
                                  .where('timestamp - node.created > ?', 300) # don't report edits within 5 mins of page creation
                                  .limit(10)
                                  .group('node.title')

SELECT  "comments".* FROM "comments" INNER JOIN "answers" ON "answers"."id" = "comments"."aid" INNER JOIN "users" ON "users"."uid" = "comments"."uid" WHERE (timestamp - answers.created_at > 86400) GROUP BY answers.id  ORDER BY timestamp DESC LIMIT 20
---
    revisions = revisions.group('DATE(FROM_UNIXTIME(timestamp))') if Rails.env == 'production'
    @wikis += revisions
    @wikis = @wikis.sort_by(&:created_at).reverse
    @comments = Comment.joins(:node, :drupal_users)
                       .order('timestamp DESC')
                       .where('timestamp - node.created > ?', 86_400) # don't report edits within 1 day of page creation
                       .limit(20)
                       .group('title') # group by day: http://stackoverflow.com/questions/5970938/group-by-day-from-timestamp