app/controllers/users_controller.rb

  def list
    # allow admins to view recent users
    if params[:id]
      @users = DrupalUser.joins('INNER JOIN rusers ON rusers.username = users.name')
                          .order("updated_at DESC")
                          .where('rusers.role = ?', params[:id])
                          .page(params[:page])
    else
      # recently active
      @users = DrupalUser.select('*, MAX(node.changed) AS last_updated')
                          .joins(:node)
                          .group('users.uid')
                          .where('node.status = 1')
                          .order("last_updated DESC")
                          .page(params[:page])
    end
    @users = @users.where('users.status = 1') unless current_user && (current_user.role == "admin" || current_user.role == "moderator")
---
SELECT  *, MAX(node.changed) AS last_updated FROM "users" INNER JOIN "node" ON "node"."uid" = "users"."uid" WHERE (users.status = 1 AND node.status = 1) GROUP BY users.uid  ORDER BY last_updated DESC LIMIT 30 OFFSET 0
SELECT  "node".* FROM "node"  WHERE "node"."uid" = 1  ORDER BY changed DESC LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."name" = 'admin' LIMIT 1