app/controllers/user_sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."name" = 'admin' LIMIT 1
---
      @user = User.find_by(username: username)

      # try finding by email, if that exists
      if @user.nil? && !User.where(email: username).empty?