app/controllers/wiki_controller.rb

SELECT  "node".* FROM "node"  WHERE "node"."path" IN ('/location-privacy', '/tool/location-privacy', '/wiki/location-privacy', '/place/location-privacy')  ORDER BY "node"."nid" ASC LIMIT 1
SELECT COUNT(*) FROM "node"  WHERE "node"."type" = 'feature' AND "node"."title" = 'anniversary-banner'
---
  def show
    @node = if params[:lang]
              Node.find_wiki(params[:lang] + '/' + params[:id])
            else
              Node.find_wiki(params[:id])
    end

    if @node&.has_power_tag('redirect') && Node.where(nid: @node.power_tag('redirect')).exists?
      if current_user.nil? || !current_user.can_moderate?
        redirect_to Node.find(@node.power_tag('redirect')).path
        return
      elsif current_user.can_moderate?
        flash.now[:warning] = "Only moderators and admins see this page, as it is redirected to <a href='#{Node.find(@node.power_tag('redirect')).path}'>#{Node.find(@node.power_tag('redirect')).title}</a>.
        To remove the redirect, delete the tag beginning with 'redirect:'"